ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_i2c.h
/***************************************************************************//**
* \file cy_scb_i2c.h
* \version 1.0
*
* Provides I2C API declarations of the SCB driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

/**
* \addtogroup group_scb_i2c
* \{
* Driver API for I2C Bus Peripheral
*
* I2C - The Inter-Integrated Circuit (I2C) bus is an industry-standard.
* The two-wire hardware interface was developed by Philips Semiconductors
* (now NXP Semiconductors).
*
* The I2C peripheral driver provides an API to implement I2C slave, master,
* or master-slave devices based on the SCB hardware block.
* I2C devices based on SCB hardware are compatible with I2C
* Standard-mode, Fast-mode, and Fast-mode Plus specifications as defined in
* the I2C-bus specification.
*
* Features:
* * An industry-standard I2C bus interface
* * Supports slave, master, and master-slave operation
* * Supports standard data rates of 100/400/1000 kbps
* * Hardware Address Match, multiple addresses
* * Wake From DeepSleep on Address Match
*
* \section group_scb_i2c_configuration Configuration Considerations
*
* To set up the I2C driver, provide the configuration parameters in the
* \ref cy_stc_scb_i2c_config_t structure. For master configuration,
* provide i2cMode, useRxFifo, and useTxFifo. For slave mode also provide the
* slaveAddress and slaveAddressMask. The other parameters are optional for
* operation.
* To initialize the driver, call the \ref Cy_SCB_I2C_Init function providing the
* filled \ref cy_stc_scb_i2c_config_t structure and allocated
* \ref cy_stc_scb_i2c_context_t. Before calling \ref Cy_SCB_I2C_Enable to start
* the I2C operation, the \ref Cy_SCB_I2C_SetDataRate must be called to set
* the data rate.
*
* Master mode operation: \n
* There are two methods for initiating I2C master transactions.
* These two methods are described below. Only one method should be used
* at a time. They should not be mixed.
*
* * Call \ref Cy_SCB_I2C_MasterRead or \ref Cy_SCB_I2C_MasterWrite to
*   communicate with the slave. These functions do not block and only
*   start a transaction. After a transfer is started, the
*   \ref Cy_SCB_I2C_Interrupt handles the further data transfer until its
*   completion. Therefore, \ref Cy_SCB_I2C_Interrupt must be called inside the
*   user interrupt handler to make the API above work. To monitor the transfer,
*   use \ref Cy_SCB_I2C_MasterGetStatus or \ref Cy_SCB_I2C_RegisterEventCallback
*   to register callback function to be notified about
*   \ref group_scb_i2c_macro_callback_events.
*
* * Call \ref Cy_SCB_I2C_MasterSendStart to generate a start, send an address
*   with the Read/Write direction bit, and receive acknowledgment. After the
*   address is ACKed by the slave, the transaction can be continued by calling
*   \ref Cy_SCB_I2C_MasterReadByte or \ref Cy_SCB_I2C_MasterWriteByte depending
*   on its direction. These functions handle one byte per call, therefore
*   they should be called for each byte in the transaction. Note that for the
*   Read transaction the last byte must be NAKed. To complete the current
*   transaction, call \ref Cy_SCB_I2C_MasterSendStop or call
*   \ref Cy_SCB_I2C_MasterSendReStart to complete the current transaction and
*   start a new one. Typically, do a restart to change the transaction
*   direction without releasing the bus from the master control.
*   Note that these functions are blocking and do not require calling
*   \ref Cy_SCB_I2C_Interrupt inside the user interrupt handler. Using these
*   functions requires extensive knowledge of the I2C protocol to execute
*   transactions correctly.
*
* Slave mode operation:
*
* The slave operation is based on the \ref Cy_SCB_I2C_Interrupt that must be
* called inside the user interrupt handler. The Read and Write buffer must
* be provided for the slave to enable communication with the master. Use
* \ref Cy_SCB_I2C_SlaveConfigReadBuf and \ref Cy_SCB_I2C_SlaveConfigWriteBuf
* for this purpose. Note that after transaction completion the buffer must be
* configured again. Otherwise, the same buffer is used starting from the point
* where the master stopped a previous transaction.
* For example: The Read buffer is configured to be 10 bytes and the master Read
* is 8 bytes. If the Read buffer is not configured again, the next master Read
* will start from the 9th byte.
* To monitor the transfer status, use \ref Cy_SCB_I2C_SlaveGetStatus or
* use \ref Cy_SCB_I2C_RegisterEventCallback to register a callback function
* to be notified about \ref group_scb_i2c_macro_callback_events.
*
* \note All slave API (except \ref Cy_SCB_I2C_SlaveAbortRead and
* \ref Cy_SCB_I2C_SlaveAbortWrite) are not interrupt-protected and to
* prevent a race condition, they should be protected from the I2C interruption
* in the place where they are called.
*
* \section group_scb_i2c_more_information More Information
*
* For more information on the SCB peripheral, refer to the technical reference
* manual (TRM).
*
* \section group_scb_i2c_MISRA MISRA-C Compliance
* <table class="doxtable">
*   <tr>
*     <th>MISRA Rule</th>
*     <th>Rule Class (Required/Advisory)</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>13.7</td>
*     <td>R</td>
*     <td>Boolean operations whose results are invariant shall not be
*     permitted.</td>
*     <td>The same condition check is executed before and after callback is
*         called because after the callback returns, the condition might be not
*         true any more.</td>
*   </tr>
*   <tr>
*     <td>14.2</td>
*     <td>R</td>
*     <td>All non-null statements shall either: a) have at least one side-effect
*         however executed, or b) cause control flow to change.</td>
*     <td>The unused function parameters are cast to void. This statement
*         has no side-effect and is used to suppress a compiler warning.</td>
*   </tr>
* </table>
*
* \section group_scb_i2c_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_scb_i2c_macro Macro
* \defgroup group_scb_i2c_functions Functions
* \defgroup group_scb_i2c_data_structures Data Structures
* \defgroup group_scb_i2c_enums Enumerated Types
*/

#if !defined(CY_SCB_I2C_H)
#define CY_SCB_I2C_H

#include "cy_scb_common.h"

#if defined(__cplusplus)
extern "C" {
#endif

