ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_i2c.h
/***************************************
*          Enumerated Types
***************************************/

/**
* \addtogroup group_scb_i2c_enums
* \{
*/

/** I2C status codes */
typedef enum
{
    /** Operation completed successfully */
    CY_SCB_I2C_SUCCESS = 0x00U,

    /** One or more of input parameters are invalid */
    CY_SCB_I2C_BAD_PARAM = CY_SCB_ID | CY_PDL_STATUS_ERROR | CY_SCB_I2C_ID | 1UL,

    /**
    * The master is not ready to start a new transaction.
    * Either the master is still processing a previous transaction or in the
    * master-slave mode the slave operation is in progress. Call this function
    * again once that operation is completed or aborted.
    */
    CY_SCB_I2C_MASTER_NOT_READY,

    /**
    * The master operation timed out before completing. Applicable only for
    * the master functions which allows byte processing.
    */
    CY_SCB_I2C_MASTER_MANUAL_TIMEOUT,

    /** The slave NACKed the address. Applicable only for the master functions
    * which allows byte processing.
    */
    CY_SCB_I2C_MASTER_MANUAL_ADDR_NAK,

    /** The slave NACKed the data byte. Applicable only for the master
    * functions which allows byte processing. */
    CY_SCB_I2C_MASTER_MANUAL_NAK,

    /**
    * The master lost arbitration, the transaction was aborted. Applicable only
    * for the master functions which allows byte processing.
    */
    CY_SCB_I2C_MASTER_MANUAL_ARB_LOST,

    /**
    * The master detected an erroneous start or stop, the transaction was
    * aborted. Applicable only  for the master functions which allows byte
    * processing.
    */
    CY_SCB_I2C_MASTER_MANUAL_BUS_ERR,

    /**
    * The master transaction was aborted and the slave transaction is on-going
    * because the slave was addressed before the master generated a start.
    * Applicable only  for the master functions which allows byte processing.
    */
    CY_SCB_I2C_MASTER_MANUAL_ABORT_START
} cy_en_scb_i2c_status_t;
/** \} group_scb_i2c_enums */


/***************************************
*       Type Definitions
***************************************/

/**
* \addtogroup group_scb_i2c_data_structures
* \{
*/

/**
* Provides the typedef for the callback function called in the
* \ref Cy_SCB_I2C_Interrupt to notify the user about occurrences of
* \ref group_scb_i2c_macro_callback_events.
*/
typedef void (* scb_i2c_handle_events_t)(uint32_t event);

/**
* Provides the typedef for the callback function called in the
* \ref Cy_SCB_I2C_Interrupt to notify the user about occurrences of
* \ref group_scb_i2c_macro_addr_callback_events.
* This callback must return a decision to ACK (continue transaction) or
* NAK (end transaction) the received address.
* See \ref group_scb_i2c_macro_ack_nack for the set of constants.
* Note if the slave configured to accept an address in RX FIFO, it must read
* from it using the \ref Cy_SCB_ReadRxFifo function.
*/
typedef uint32_t (* scb_i2c_handle_addr_t)(uint32_t event);

/** I2C Configuration Structure */
typedef struct cy_stc_scb_i2c_config
{
    /**
    * Specifies the mode of operation (See \ref group_scb_i2c_macro_modes
    * for the set of constants)
    */
    uint32_t i2cMode;

    /**
    * If the RX FIFO is used, the possibility of clock stretching is greatly
    * reduced, and the interrupt overhead during an I2C transaction is also
    * reduced. The reason: the hardware is configured to automatically ACK
    * incoming data, and the interrupt is configured to take data out of the
    * RX FIFO.
    * * For the master mode, the drawback is that the master may receive more
    *   data than desired due to the interrupt latency. An interrupt fires
    *   when the second-to-last byte has been received, this interrupt tells
    *   the hardware to stop receiving data. If the latency of this interrupt
    *   is longer than 1 transfer of the byte on the I2C bus, then the
    *   hardware automatically ACKs the following bytes until the interrupt
    *   is serviced or the RX FIFO becomes full.
    * * For the slave mode, the drawback is that the slave will only NACKs
    *   the master when the RX FIFO becomes full, NOT when the slave write
    *   firmware buffer becomes full.
    * Note that all received extra bytes will be dropped in any mode.
    * To avoid these drawbacks, do not enable this option. Then, hardware is
    * configured to trigger an interrupt when a byte is available in the
    * RX FIFO. After the byte is read, an ACK or NACK decision is made.
    * Therefore, each received bytes requires the interrupt service to
    * continue the transfer and that leads to increasing the interrupt
    * overhead and the possibility of clock stretching.
    * This parameter is not available if f acceptAddrInFifo is true.
    */
    bool useRxFifo;

    /**
    * If the TX FIFO is used, the possibility of clock stretching is greatly
    * reduced, and the interrupt overhead during an I2C transaction is
    * also reduced. The reason: the TX FIFO is fully loaded with data and
    * the interrupt is configured to keep the TX FIFO loaded.
    * The drawback of using this option is that the abort operation clears
    * the TX FIFO. The TX FIFO clear operation also clears the shift
    * register so that the shifter can be cleared in the middle of a byte
    * transfer, corrupting it. The remaining bits to transfer within the
    * corrupted byte are complemented with 1s. If this is an issue,
    * then do not enable this option.
    * If the TX FIFO is not used, then data is written to the TX FIFO byte
    * by byte. This leads to more interrupts and also increases the
    * possibility of clock stretching.
    * Use the TX FIFO if the abort function is not used.
    */
    bool useTxFifo;

    /**
    * The 7-bit right justified slave address, used only for the slave mode
    */
    uint8_t slaveAddress;

    /**
    * The slave address mask, bit 0, must always be 0. It's used only for the
    * slave mode
    */
    uint8_t slaveAddressMask;

    /**
    * True - the slave address is accepted in RX FIFO, false - the slave
    * addresses are not accepted in FIFO
    */
    bool acceptAddrInFifo;

    /**
    * True - accept the general call address; false - ignore the general
    * call address.
    */
    bool ackGeneralAddr;

    /**
    * When set, the slave will wake the device from deep sleep on an address
    * match (the device datasheet must be consulted to determine which SCBs
    * support this mode)
    */
    bool enableWakeFromSleep;
} cy_stc_scb_i2c_config_t;

/** I2C Internal structure, holds data used by I2C functions */
typedef struct cy_stc_scb_i2c_context
{
    bool useRxFifo;             /**< Holds RX FIFO configuration */
    bool useTxFifo;             /**< Holds TX FIFO configuration */

    uint32_t state;             /**< Holds state of driver */

    uint32_t masterStatus;      /**< Holds master status */
    bool     masterPause;       /**< Stores how master ends transfer */
    bool     masterRdDir;       /**< Stores direction of master transfer */

    uint8_t  *masterBuffer;     /**< Pointer to master buffer transmit or receive buffer */
    uint32_t  masterBufferIdx;  /**< Current Read/Write location in master buffer */
    uint32_t  masterBufferSize; /**< End of master buffer */
    uint32_t  masterNumBytes;   /**< Number of bytes sent or received */

    uint32_t  slaveStatus;      /**< Holds slave status */
    bool      slaveRdBufEmpty;  /**< Tracks slave Read buffer empty event */

    uint8_t  *slaveTxBuffer;     /**< Pointer to slave TX buffer */
    uint32_t  slaveTxBufferIdx;  /**< Current Read location in the slave TX buffer */
    uint32_t  slaveTxBufferSize; /**< End of slave TX buffer */
    uint32_t  slaveTxBufferCnt;  /**< Number of transferred bytes */

    uint8_t  *slaveRxBuffer;     /**< Pointer to slave RX buffer */
    uint32_t  slaveRxBufferIdx;  /**< Current Write location in the slave buffer */
    uint32_t  slaveRxBufferSize; /**< End of slave buffer */

    /**
    * The pointer to an event callback that is called when an I2C event occurs
    */
    scb_i2c_handle_events_t cbEvents;

    /**
    * The pointer to an address callback, used only for the slave
    */
    scb_i2c_handle_addr_t   cbAddr;
} cy_stc_scb_i2c_context_t;

/** The I2C Master transfer structure */
typedef struct cy_stc_scb_i2c_master_xfer_config
{
    uint8_t  slaveAddress;  /**< Address of slave to start transfer with */
    uint8_t  *buffer;       /**< Pointer to buffer for data to read from slave
                                 or with data to write into slave */
    uint32_t bufferSize;    /**< Size of buffer */
    bool     xferPending;   /**< Transfer operation is pending -
                                 Stop condition will not be generated */
} cy_stc_scb_i2c_master_xfer_config_t;
