ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_i2c.h
/** \} group_scb_i2c_data_structures */


/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_scb_i2c_functions
* \{
*/
/* Basic functions */
cy_en_scb_i2c_status_t Cy_SCB_I2C_Init(CySCB_Type *base, cy_stc_scb_i2c_config_t const *config,
                                       cy_stc_scb_i2c_context_t *context);
void     Cy_SCB_I2C_DeInit (CySCB_Type *base);
__STATIC_INLINE void Cy_SCB_I2C_Enable(CySCB_Type *base);
void     Cy_SCB_I2C_Disable(CySCB_Type *base, cy_stc_scb_i2c_context_t *context);

/* Data rate configuration functions */
uint32_t Cy_SCB_I2C_SetDataRate(CySCB_Type *base, uint32_t dataRateHz, uint32_t scbClockkHz);
uint32_t Cy_SCB_I2C_GetDataRate(CySCB_Type const *base, uint32_t scbClockkHz);

/* Configure slave address */
__STATIC_INLINE void     Cy_SCB_I2C_SlaveSetAddress    (CySCB_Type *base, uint8_t addr);
__STATIC_INLINE uint32_t Cy_SCB_I2C_SlaveGetAddress    (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_I2C_SlaveSetAddressMask(CySCB_Type *base, uint8_t addrMask);
__STATIC_INLINE uint32_t Cy_SCB_I2C_SlaveGetAddressMask(CySCB_Type const *base);

/* Configure master oversampling */
__STATIC_INLINE void Cy_SCB_I2C_MasterSetLowPhaseDutyCycle (CySCB_Type *base, uint32_t clockCycles);
__STATIC_INLINE void Cy_SCB_I2C_MasterSetHighPhaseDutyCycle(CySCB_Type *base, uint32_t clockCycles);

/* Low power functions */
void Cy_SCB_I2C_DeepSleep(CySCB_Type *base, uint32_t wakeupAction);
void Cy_SCB_I2C_Wakeup   (CySCB_Type *base);

__STATIC_INLINE bool     Cy_SCB_I2C_IsBusBusy          (CySCB_Type const *base);

/* Register callbacks */
__STATIC_INLINE void Cy_SCB_I2C_RegisterEventCallback(CySCB_Type const *base, scb_i2c_handle_events_t callback,
                                                      cy_stc_scb_i2c_context_t *context);
__STATIC_INLINE void Cy_SCB_I2C_RegisterAddrCallback (CySCB_Type const *base, scb_i2c_handle_addr_t callback,
                                                      cy_stc_scb_i2c_context_t *context);

/* Slave functions */
uint32_t Cy_SCB_I2C_SlaveGetStatus(CySCB_Type const *base, cy_stc_scb_i2c_context_t const *context);

void     Cy_SCB_I2C_SlaveConfigReadBuf       (CySCB_Type const *base, uint8_t *rdBuf, uint32_t size,
                                              cy_stc_scb_i2c_context_t *context);
void     Cy_SCB_I2C_SlaveAbortRead           (CySCB_Type *base, cy_stc_scb_i2c_context_t *context);
uint32_t Cy_SCB_I2C_SlaveGetReadTransferCount(CySCB_Type const *base, cy_stc_scb_i2c_context_t const *context);
uint32_t Cy_SCB_I2C_SlaveClearReadStatus     (CySCB_Type const *base, cy_stc_scb_i2c_context_t *context);

void     Cy_SCB_I2C_SlaveConfigWriteBuf       (CySCB_Type const *base, uint8_t *wrBuf, uint32_t size,
                                               cy_stc_scb_i2c_context_t *context);
void     Cy_SCB_I2C_SlaveAbortWrite           (CySCB_Type *base, cy_stc_scb_i2c_context_t *context);
uint32_t Cy_SCB_I2C_SlaveGetWriteTransferCount(CySCB_Type const *base, cy_stc_scb_i2c_context_t const *context);
uint32_t Cy_SCB_I2C_SlaveClearWriteStatus     (CySCB_Type const *base, cy_stc_scb_i2c_context_t *context);

/* Master interrupt processing functions */
uint32_t Cy_SCB_I2C_MasterGetStatus(CySCB_Type const *base, cy_stc_scb_i2c_context_t const *context);

cy_en_scb_i2c_status_t Cy_SCB_I2C_MasterRead(CySCB_Type *base, cy_stc_scb_i2c_master_xfer_config_t* masterXferConfig,
                                           cy_stc_scb_i2c_context_t *context);
void     Cy_SCB_I2C_MasterAbortRead       (CySCB_Type *base, cy_stc_scb_i2c_context_t *context);
cy_en_scb_i2c_status_t Cy_SCB_I2C_MasterWrite(CySCB_Type *base, cy_stc_scb_i2c_master_xfer_config_t *masterXferConfig,
                                           cy_stc_scb_i2c_context_t *context);
void     Cy_SCB_I2C_MasterAbortWrite      (CySCB_Type *base, cy_stc_scb_i2c_context_t *context);
uint32_t Cy_SCB_I2C_MasterGetTransferCount(CySCB_Type const *base, cy_stc_scb_i2c_context_t const *context);

/* Master manual processing functions */
cy_en_scb_i2c_status_t Cy_SCB_I2C_MasterSendStart  (CySCB_Type *base, uint32_t address, uint32_t bitRnW, uint32_t timeoutMs,
                                                    cy_stc_scb_i2c_context_t *context);
cy_en_scb_i2c_status_t Cy_SCB_I2C_MasterSendReStart(CySCB_Type *base, uint32_t address, uint32_t bitRnW, uint32_t timeoutMs,
                                                    cy_stc_scb_i2c_context_t *context);
cy_en_scb_i2c_status_t Cy_SCB_I2C_MasterSendStop   (CySCB_Type *base,uint32_t timeoutMs, cy_stc_scb_i2c_context_t *context);
cy_en_scb_i2c_status_t Cy_SCB_I2C_MasterReadByte   (CySCB_Type *base, uint32_t ackNack, uint8_t *byte, uint32_t timeoutMs,
                                                    cy_stc_scb_i2c_context_t *context);
cy_en_scb_i2c_status_t Cy_SCB_I2C_MasterWriteByte  (CySCB_Type *base, uint32_t theByte, uint32_t timeoutMs,
                                                    cy_stc_scb_i2c_context_t *context);
/* Interrupt handler */
void Cy_SCB_I2C_Interrupt(CySCB_Type *base, cy_stc_scb_i2c_context_t *context);
/** \} group_scb_i2c_functions */


/***************************************
*            API Constants
***************************************/

/**
* \addtogroup group_scb_i2c_macro
* \{
*/

/**
* \defgroup group_scb_i2c_macro_modes I2C Modes
* \{
*/
#define CY_SCB_I2C_SLAVE           (1U)    /**< Configures SCB for I2C Slave operation */
#define CY_SCB_I2C_MASTER          (2U)    /**< Configures SCB for I2C Master operation */
#define CY_SCB_I2C_MASTER_SLAVE    (3U)    /**< Configures SCB for I2C Master-Slave operation */
/** \} group_scb_i2c_macro_modes */

/**
* \defgroup group_scb_i2c_macro_slave_status I2C Slave Status
* Each I2C slave status is encoded in a separate bit, therefore multiple bits
* may be set to indicate the current status.
* \{
*/
/** There is a Read transaction in progress */
#define CY_SCB_I2C_SLAVE_RD_BUSY       (0x00000001UL)

/**
* All read data has been loaded to TX FIFO, applicable only if TX FIFO is
* enabled
*/
#define CY_SCB_I2C_SLAVE_RD_IN_FIFO    (0x00000002UL)

/**
* The master has finished reading data from the slave
*/
#define CY_SCB_I2C_SLAVE_RD_CMPLT      (0x00000004UL)

/**
* Set when the master tried to read more bytes than available in the configured
* read buffer. The slave is not able to finish the transaction and sends
* \ref CY_SCB_I2C_DEFAULT_TX.
*/
#define CY_SCB_I2C_SLAVE_RD_UNDRFL     (0x00000008UL)

/** There is a Write transaction in progress */
#define CY_SCB_I2C_SLAVE_WR_BUSY       (0x00000010UL)

/**
* The master has finished writing data into the slave
*/
#define CY_SCB_I2C_SLAVE_WR_CMPLT      (0x00000020UL)

/**
* The master attempted to write more bytes than space available in the
* configured Write buffer. Note that all subsequent bytes are dropped.
*/
#define CY_SCB_I2C_SLAVE_WR_OVRFL      (0x00000040UL)

/** The slave lost arbitration, the transaction was aborted */
#define CY_SCB_I2C_SLAVE_ARB_LOST      (0x00000080UL)

/**
* The slave captured an error on the bus during a master transaction (sources
* of error is misplaced Start or Stop).
*/
#define CY_SCB_I2C_SLAVE_BUS_ERR       (0x00000100UL)
/** \} group_scb_i2c_macro_slave_status */

/**
* \defgroup group_scb_i2c_macro_master_status I2C Master Status
* Each I2C master status is encoded in a separate bit, therefore multiple
* bits may be set to indicate the current status.
* \{
*/

/**
* The master is busy executing operation initiated by \ref Cy_SCB_I2C_MasterRead
* or \ref Cy_SCB_I2C_MasterWrite
*/
#define CY_SCB_I2C_MASTER_BUSY         (0x00010000UL)

/**
* All Write data has been loaded to the TX FIFO
*/
#define CY_SCB_I2C_MASTER_WR_IN_FIFO   (0x00020000UL)

/** The slave NACKed the address. */
#define CY_SCB_I2C_MASTER_ADDR_NAK     (0x00100000UL)

/** Write completed before all bytes were sent (last byte was NAKed)
*/
#define CY_SCB_I2C_MASTER_DATA_NAK     (0x00200000UL)

/** The master lost arbitration, the transaction was aborted */
#define CY_SCB_I2C_MASTER_ARB_LOST     (0x00400000UL)

/**
* The master detected an erroneous start or stop, the transaction was aborted
*/
#define CY_SCB_I2C_MASTER_BUS_ERR      (0x00800000UL)

/**
* The master transaction was aborted and the slave transaction is on-going
* because the slave was addressed before the master generated a start
*/
#define CY_SCB_I2C_MASTER_ABORT_START  (0x01000000UL)
/** \} group_scb_i2c_macro_master_status */

/**
* \defgroup group_scb_i2c_macro_direction I2C Direction
* \{
*/
#define CY_SCB_I2C_WRITE_XFER  (0UL)   /**< Current transaction is Write */
#define CY_SCB_I2C_READ_XFER   (1UL)   /**< Current transaction is Read */
/** \} group_scb_i2c_macro_direction */

/**
* \defgroup group_scb_i2c_macro_ack_nack I2C ACK NAK
* \{
*/
#define CY_SCB_I2C_ACK (SCB_I2C_S_CMD_S_ACK_Msk)  /**< Send ACK to current byte */
#define CY_SCB_I2C_NAK (SCB_I2C_S_CMD_S_NACK_Msk) /**< Send NAK to current byte */
/** \} group_scb_i2c_macro_ack_nack */

/**
* \defgroup group_scb_i2c_macro_wake_up I2C Wakeup Actions
* \{
*/
#define CY_SCB_I2C_WAKEUP_STRETCH (0UL) /**< Slave will stretch clock on wakeup */
#define CY_SCB_I2C_WAKEUP_NACK    (1UL) /**< Slave will NAK address on wakeup */
/** \} group_scb_i2c_macro_wake_up */

/**
* \defgroup group_scb_i2c_macro_callback_events I2C Callback Events
* \{
* Each event is encoded in a separate bit, and therefore it is possible to
* notify about multiple events.
*/
/**
* Indicates that the slave was addressed and the master wants to read data.
* This event can be used to configure the slave Read buffer.
*/
#define CY_SCB_I2C_SLAVE_READ_EVENT            (0x00000001UL)

/**
* Indicates that the slave was addressed and the master wants to write data.
* This event can be used to configure the slave Write buffer.
*/
#define CY_SCB_I2C_SLAVE_WRITE_EVENT           (0x00000002UL)

/**
* All slave data from the configured Read buffer has been loaded to TX FIFO.
* The content of the Read buffer can be modified. Applicable only if TX FIFO is
* enabled.
*/
#define CY_SCB_I2C_SLAVE_RD_IN_FIFO_EVENT      (0x00000004UL)

/**
* The master has read all data out of the configured Read buffer.
* This event can be used to configure the next Read buffer. If the buffer remains
* empty, the \ref CY_SCB_I2C_DEFAULT_TX bytes are returned to the master.
*/
#define CY_SCB_I2C_SLAVE_RD_BUF_EMPTY_EVENT    (0x00000008UL)

/**
* Indicates the master completed reading from the slave (set by master NAK
* or Stop)
*/
#define CY_SCB_I2C_SLAVE_RD_CMPLT_EVENT        (0x00000010UL)

/**
* Indicates master completed writing to the slave (set by master Stop
* or Restart)
*/
#define CY_SCB_I2C_SLAVE_WR_CMPLT_EVENT        (0x00000020UL)

/**
* Indicates the I2C hardware detected an error.
* Check \ref Cy_SCB_I2C_SlaveGetStatus to determine the source of the error.
*/
#define CY_SCB_I2C_SLAVE_ERR_EVENT             (0x00000040UL)

/**
* All master write data has been loaded to TX FIFO.
* The content of the Write buffer can be modified. Applicable only if
* TX FIFO is enabled.
*/
#define CY_SCB_I2C_MASTER_WR_IN_FIFO_EVENT     (0x00010000UL)

/**
* Indicates the master completed writing data to the slave
*/
#define CY_SCB_I2C_MASTER_WR_CMPLT_EVENT       (0x00020000UL)

/**
* Indicates the master completed reading data from the slave
*/
#define CY_SCB_I2C_MASTER_RD_CMPLT_EVENT       (0x00040000UL)

/**
* Indicates the I2C hardware detected an error. It occurs together with
* \ref CY_SCB_I2C_MASTER_RD_CMPLT_EVENT or \ref CY_SCB_I2C_MASTER_WR_CMPLT_EVENT
* depends on the direction of the transfer.
* Check \ref Cy_SCB_I2C_MasterGetStatus to determine the source of the error.
*/
#define CY_SCB_I2C_MASTER_ERR_EVENT            (0x00080000UL)
/** \} group_scb_i2c_macro_callback_events */

/**
* \defgroup group_scb_i2c_macro_addr_callback_events I2C Address Callback Events
* Each event is encoded in a separate bit and therefore it is possible to
* notify about multiple events.
* \{
*/
/**
* Indicates the slave was addressed by the general call address
*/
#define CY_SCB_I2C_GENERAL_CALL_EVENT      (0x01UL)

/**
* The slave address is in the RX FIFO.
* Note that the address must be read from the RX FIFO using the
* \ref Cy_SCB_ReadRxFifo function.
*/
#define CY_SCB_I2C_ADDR_IN_FIFO_EVENT      (0x02UL)
/** \} group_scb_i2c_macro_addr_callback_events */

/**
* This value is returned by the slave when there is no data in the
* Read buffer
*/
#define CY_SCB_I2C_DEFAULT_TX  (0xFFUL)


